#Проект "Холодильник"
Учебный проект: домашнее задание по курсу "Python разработчик плюс" от Яндекс Практикум

##Задание
Написать программу, которая будет:
1. Хранить перечень продуктов, их количество и срок годности;
2. Позволит добавлять новые продукты в перечень продуктов;
3. Позволит получать информацию о содержимом холодильника.

Информация о наборе продуктов в холодильнике должна храниться в виде словаря: goods

goods = {
    'Пельмени Универсальные': [
        {'amount': Decimal('0.5'), 'expiration_date': datetime.date(2023, 7, 15)},
        {'amount': Decimal('2'), 'expiration_date': datetime.date(2023, 8, 1)}
    ],
    'Вода': [{'amount': Decimal('1.5'), 'expiration_date': None}]
} 

Ключ каждого элемента словаря — это название определённого продукта. Значение каждого элемента словаря — это список словарей. 

Каждый вложенный словарь содержит два элемента:
amount — количество продукта.
expiration_date — срок годности.

Количество продукта — это:
целое число для исчисляемых продуктов (в штуках: например, значение 10 для яиц);
дробное число для весовых продуктов (в килограммах: например, значение 1.5 для воды).

Если срок годности не указан, вместо него должно быть указано None.

В программе должно быть пять функций для управления содержимым холодильника:

add() — добавляет продукт в словарь goods;

add_by_note() — добавляет продукт в словарь goods, преобразуя текстовое описание продукта в структурированные данные;

find() — ищет в словаре goods заданное слово или строку и возвращает список продуктов, в названии которых есть это слово;

amount() — возвращает количество запрошенного продукта;

expire() — возвращает список просроченных продуктов.

##Описание функций

###Добавление продукта: функция add()
Когда пользователь что-то кладёт в холодильник, он должен добавить в словарь goods очередную партию продукта. Для этого применяется функция add().
Если в словаре уже есть ключ, совпадающий с названием добавляемого продукта — новая партия продукта должна быть добавлена в список, хранящийся под этим ключом.
Если такого продукта в словаре goods нет — в словарь надо добавить новый элемент.

В словаре уже есть продукт "Пельмени Универсальные"
goods = {
    'Пельмени Универсальные': [
        {'amount': Decimal('0.5'), 'expiration_date': datetime.date(2023, 9, 30)}
    ]
}

Пользователь купил ещё два килограмма пельменей с тем же названием.
Добавляем покупку в словарь goods:
add(goods, 'Пельмени Универсальные', Decimal('2'), '2023-10-28')

Словарь goods должен стать таким:

goods = {
     'Пельмени Универсальные': [
         {'amount': Decimal('0.5'), 'expiration_date': datetime.date(2023, 9, 30)}
         {'amount': Decimal('2'), 'expiration_date': datetime.date(2023, 10, 28)}
     ]
} 

###Параметры функции add()
У функции add() должно быть четыре параметра:

add(items, title, amount, expiration_date=None) 

items — словарь, который хранит список продуктов (goods).
title — название добавляемого продукта, строка. Может содержать пробелы.
amount — количество добавляемого продукта.
expiration_date — срок годности добавляемого продукта, строка в формате %Y-%m-%d, например '2023-9-30'. Это необязательный параметр.

Возвращаемое значение
Функция добавляет в словарь goods новые данные и не возвращает никакого значения.

Пример объявления и использования

import datetime
from decimal import Decimal

goods = {
    'Яйца': [{'amount': Decimal('1'), 'expiration_date': datetime.date(2023, 6, 24)}],
    'Яйца гусиные': [{'amount': Decimal('4'), 'expiration_date': datetime.date(2023, 7, 15)}],
    'Морковь': [{'amount': Decimal('2'), 'expiration_date': datetime.date(2023, 8, 6)}]
}

def find(items, needle):
    pass

Ищем продукты, в названии которых есть подстрока "йц". 
Регистр символов не должен влиять на поиск.

print(find(goods, 'йц'))

Вывод: ['Яйца', 'Яйца гусиные'] 

###Узнать количество продукта: функция amount()

Один и тот же продукт мог быть закуплен несколько раз, в результате словарь goods будет хранить информацию о нескольких партиях этого продукта:

goods = {
    'Морковь': [  # Продукт "Морковь" покупали дважды:
        {'amount': Decimal('2'), 'expiration_date': datetime.date(2023, 8, 1)},
        {'amount': Decimal('3'), 'expiration_date': datetime.date(2023, 8, 6)}
    ]
} 

Функция amount() предназначена для определения количества продукта с заданным названием. Эта функция должна вернуть число: общее количество продуктов, названия которых частично или полностью совпадают со строкой, переданной в параметры.

Параметры функции amount()

amount(items, needle) 

items — словарь, который хранит список продуктов (goods).
needle — строка для поиска продукта. Поиск должен быть нечувствителен к регистру.

Возвращаемое значение
Функция возвращает общее количество запрошенного продукта — число типа Decimal.
Пример объявления и использования

import datetime
from decimal import Decimal

goods = {
    'Яйца': [{'amount': Decimal('1'), 'expiration_date': None}],
    'Морковь': [
        {'amount': Decimal('2'), 'expiration_date': datetime.date(2023, 8, 1)},
        {'amount': Decimal('3'), 'expiration_date': datetime.date(2023, 8, 6)}
    ],
    'Вода': [{'amount': Decimal('2.5'), 'expiration_date': None}]
}


def amount(items, needle):
    pass


print(amount(goods, 'яйца'))
Вывод: 1
print(amount(goods, 'морковь'))
Вывод: 5 

###Получить список просроченных продуктов: функция expire()

Эта функция должна вернуть список продуктов, срок годности которых истёк или скоро истечёт: эти продукты надо использовать в первую очередь или избавиться от них.
Параметры функции expire()
У функции expire() должно быть два параметра:

expire(items, in_advance_days=0) 

items — словарь, который хранит список продуктов (goods).
in_advance_days — число дней, оставшееся до истечения срока годности продукта. Например, если указать in_advance_days = 2, то функция должна вернуть все продукты, срок хранения которых уже истёк и истекает завтра (первый день) или послезавтра (второй день).

По умолчанию in_advance_days должно быть равно 0 (сегодняшний день). В этом случае функция должна вернуть продукты, срок хранения которых истёк на момент вызова.

Возвращаемое значение
Функция должна вернуть список кортежей, где первый элемент — название продукта, а второй — общее количество просроченного продукта или продукта, срок хранения которого скоро истечёт.

Пример объявления и использования

import datetime as dt
from decimal import Decimal

goods = {
    'Хлеб': [
        {'amount': Decimal('1'), 'expiration_date': None},
        {'amount': Decimal('1'), 'expiration_date': dt.date(2023, 12, 9)}
    ],
    'Яйца': [
        {'amount': Decimal('2'), 'expiration_date': dt.date(2023, 12, 12)},
        {'amount': Decimal('3'), 'expiration_date': dt.date(2023, 12, 11)}
    ],
    'Вода': [{'amount': Decimal('100'), 'expiration_date': None}]
}


def expire(items, in_advance_days=0):
    pass


Вызов функции 10 декабря 2023 года
print(expire(goods))
Вывод: [('Хлеб', Decimal('1'))]

print(expire(goods, 1))
Вывод: [('Хлеб', Decimal('1')), ('Яйца', Decimal('3'))]

print(expire(goods, 2))
Вывод: [('Хлеб', Decimal('1')), ('Яйца', Decimal('5'))] 